test.xml

<?xml version="1.0" encoding="utf-8"?> <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">   <soap:Header>     <Authentication xmlns="http://www.alarm.com/WebServices">       <User>TELUSTestVerification</User>       <Password>T3lusTest</Password>       <TwoFactorDeviceId>string</TwoFactorDeviceId>     </Authentication>   </soap:Header>   
<soap:Body>        <GetCustomerInfo_V2 xmlns="http://www.alarm.com/WebServices">       <input>         <CallerVersion>1111</CallerVersion>         <CustomerId>9652332</CustomerId>       </input>     </GetCustomerInfo_V2>   </soap:Body> </soap:Envelope>
[2020-08-28 05:35:49.596   DEBUG:] Hitting as below details:
      api: https://alarmadmin.alarm.com/WebServices/CustomerManagement.asmx
      contentType: {"Content-Type":"text/xml"}
Promise { <pending> }
(node:14792) Warning: Setting the NODE_TLS_REJECT_UNAUTHORIZED environment variable to '0' makes TLS connections and HTTPS requests insecure by disabling certificate verification.
[2020-08-28 05:35:58.573   DEBUG:] response received: {"req":{"method":"post","url":"https://alarmadmin.alarm.com/WebServices/CustomerManagement.asmx","data":"<?xml version=\"1.0\" encoding=\"utf-8\"?> <soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">   <soap:Header>     <Authentication xmlns=\"http://www.alarm.com/WebServices\">       <User>TELUSTestVerification</User>       <Password>T3lusTest</Password>       <TwoFactorDeviceId>string</TwoFactorDeviceId>     </Authentication>   </soap:Header>   <soap:Body>        <GetCustomerInfo_V2 xmlns=\"http://www.alarm.com/WebServices\">       <input>         <CallerVersion>1111</CallerVersion>         <CustomerId>9652332</CustomerId>       </input>     </GetCustomerInfo_V2>   </soap:Body> </soap:Envelope>","headers":{"content-type":"text/xml"}},"header":{"cache-control":"private, max-age=0","content-type":"text/xml; charset=utf-8","content-encoding":"gzip","vary":"Accept-Encoding","server":"Microsoft-IIS/10.0","x-aspnet-version":"4.0.30319","x-powered-by":"ASP.NET","strict-transport-security":"max-age=31536000; includeSubDomains","date":"Fri, 28 Aug 2020 00:05:57 GMT","connection":"close","content-length":"1325","set-cookie":["BIGipServer~AlarmApplication~Alarm_WEBADM_AlarmAdmin_HTTPS=!BZSOBqBbOLvbDg5/qIPHdVEQtTXYIKn9eaLME4ryl19w0D6JDmm1O21oYD1NFKvlKegcbl8ovNLqJS8=; path=/; Httponly; Secure"]},"status":200,"text":"<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><GetCustomerInfo_V2Response xmlns=\"http://www.alarm.com/WebServices\"><GetCustomerInfo_V2Result><CustomerId>9652332</CustomerId><DealerCustomerId>100937395</DealerCustomerId><FirstName>Provide VkV</FirstName><LastName>RBOne xuI</LastName><PrimaryEmail>provide_one_0164948@telus.com</PrimaryEmail><PrimaryPhoneNumber>+16047706487</PrimaryPhoneNumber><LoginName>T~04144~08-27-20~provide_one_0164948@telus.com</LoginName><InstallAddress><Street1> 1220 HICKS AVE</Street1><City>MERRITT</City><State>BC</State><Zip>V1K 1K7</Zip><CountryId>Canada</CountryId></InstallAddress><IsTerminated>true</IsTerminated><IsDemo>false</IsDemo><JoinDate>2020-08-27T19:47:25.42-04:00</JoinDate><TermDate>2020-08-27T19:54:41.43</TermDate><CentralStationInfo><ReceiverPhoneNumber>+12509782961</ReceiverPhoneNumber><CentralStationPhoneNumberKey>+12509782961</CentralStationPhoneNumberKey><AccountPrefix>IPT</AccountPrefix><AccountNumber>T~D027FC</AccountNumber><TwoWayVoiceEnabled>false</TwoWayVoiceEnabled><PhoneLinePresent>false</PhoneLinePresent><ForwardingOption>Always</ForwardingOption><EventGroupsToForward><CentralStationEventGroupEnum>Alarms</CentralStationEventGroupEnum><CentralStationEventGroupEnum>Panics</CentralStationEventGroupEnum><CentralStationEventGroupEnum>Cancels</CentralStationEventGroupEnum><CentralStationEventGroupEnum>Troubles</CentralStationEventGroupEnum><CentralStationEventGroupEnum>TroubleRestorals</CentralStationEventGroupEnum><CentralStationEventGroupEnum>CrashAndSmash</CentralStationEventGroupEnum><CentralStationEventGroupEnum>PhoneTests</CentralStationEventGroupEnum><CentralStationEventGroupEnum>CancelVerify</CentralStationEventGroupEnum></EventGroupsToForward></CentralStationInfo><ServicePlanInfo><PackageId>209</PackageId><PlanType>AI</PlanType><Addons /><TotalServicePrice>0</TotalServicePrice><AddonsFilteredDueToCallerVersion>false</AddonsFilteredDueToCallerVersion><PackageDescription>Interactive + Automation</PackageDescription></ServicePlanInfo><PanelVersion>Unknown</PanelVersion><DealerId>17233</DealerId><SubDealerId xsi:nil=\"true\" /><PanelNotRespondingStatus>NeverPinged</PanelNotRespondingStatus><Culture>EnglishCanada</Culture><PropertyType>NotSet</PropertyType><InstallType>ProfessionalInstall</InstallType><DetailedPanelVersion /><UnitDescription>RBOne xuI's Home</UnitDescription><PackageTemplateId xsi:nil=\"true\" /><ZWaveTask>2</ZWaveTask><ReadyDateUtc>2020-08-27T23:47:25.42Z</ReadyDateUtc><CustomerType>Commitment</CustomerType><installerLogin /><salesRepLogin /><CustomerAddress><Street1> 1220 HICKS AVE</Street1><City>MERRITT</City><State>BC</State><Zip>V1K 1K7</Zip><CountryId>Canada</CountryId></CustomerAddress></GetCustomerInfo_V2Result></GetCustomerInfo_V2Response></soap:Body></soap:Envelope>